luentoEsimerkit2015/cliVersion/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ffminx
    {
        type            fixedFluxPressure;
        gradient        nonuniform 0();
        value           nonuniform 0();
    }
    ffmaxx
    {
        type            fixedFluxPressure;
        gradient        nonuniform 0();
        value           nonuniform 0();
    }
    ffminy
    {
        type            fixedFluxPressure;
        gradient        nonuniform 0();
        value           nonuniform 0();
    }
    ffmaxy
    {
        type            fixedFluxPressure;
        gradient        nonuniform 0();
        value           nonuniform 0();
    }
    symmetryPlane
    {
        type            symmetry;
    }
    ffmaxz
    {
        type            fixedFluxPressure;
        gradient        nonuniform 0();
        value           nonuniform 0();
    }
    inletBig
    {
        type            zeroGradient;
    }
    inletSmall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    wall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
