luentoEsimerkit2015/cliVersion/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.2.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

    materialName water;
    transportModel Newtonian;
    NewtonianCoeffs
    {
    }

    rho rho [1 -3 0 0 0 0 0 ] 998.2;
    mu mu [1 -1 -1 0 0 0 0 ] 0.001002;
    nu nu [0 2 -1 0 0 0 0 ] 1.0038068523342016E-6;
    Cp Cp [0 2 -2 -1 0 0 0 ] 4187.0;
    Prt Prt [0 0 0 0 0 0 0 ] 0.9;
    Pr Pr [0 0 0 0 0 0 0 ] 0.9;
    lambda lambda [1 1 -3 -1 0 0 0 ] 0.5985;
    pRef pRef [1 -1 -2 0 0 0 0 ] 101325.0;
    beta beta [0 0 0 -1 0 0 0 ] 0.0207;
    TRef TRef [0 0 0 1 0 0 0 ] 293.0;
    Cp0 4187.0;